Revit 2026 API

# IntersectionType Enumeration

---

Intersection type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum IntersectionType
```
```vb
Public Enumeration IntersectionType
```
```cpp
public enum class IntersectionType
```
```fsharp
type IntersectionType
```

| Member name | Value | Description |
| --- | --- | --- |
| Cut | 0 | Cut |
| Excavate | 1 | Excavate |

#### Reference

Autodesk.Revit.DB Namespace